//s4t2
//Написать программу, которая спрашивает имена и года рождения 4 людей. После этого выводит имена и кол-во лет.

package com.blockwit.learn1.mrserg86;

import java.util.Scanner;

    public class s4t2secondPart {

        public static void main(String[] args) {

        String[] names = new String[4];
        int[] years = new int[4];
            for (int i = 0; i < names.length; i++) {
                System.out.println("Введите имя " + i + " -го человека");

            }


        }

    }
